package com.bzfar.enums;

import io.swagger.annotations.ApiModel;
import lombok.Data;
import lombok.Getter;

@Getter
@ApiModel("短息模板")
public enum NewSmsEnum {
    LOGIN_CODE("{案号,30}，{姓名,20}（{部门,30}），联系方式：{手机号码,20}，通过云柜系统给您存件，请及时取件，取件码：{取件码,10}，取件二维码：{二维码,100} 。"),
    GET_CODE("您正在进行短信验证，验证码：{验证码,6}，请勿告知他人{标点,1}"),
    TAKE_MSG(" {案号,20}，{姓名,20}（{单位,60}/{类型,10}），联系方式：{手机号 , 20}，通过云柜系统给您存件，请及时取件，取件码：{取件码 , 6}，取件二维码： {二维码地址 , 30} 。"),
    SAVE_MSG(" {案号,20}，{姓名, 20}（{单位名称, 60}/{类型, 10}），联系方式：{电话号码 , 20}，通过云柜系统给您虚拟存件"),
    SIGN_MSG("{案号,20} 案件材料，已被成功签收，收件人: {姓名, 10}({部门, 20}) {代取件人姓名,10}"),
    SAVE_OK(" {案号,20},通过云柜系统存件成功！我们已通知收件人取件，欢迎下次使用"),
    SIGN_OK("[{名称,10}]{案号,20}案件材料, 已经被成功签收 , 收件人: {姓名,5}"),
    TAKE("[{名称,10}]{案号,20}案件材料, {姓名,4} , 联系方式: {手机,13} , 通过云柜系统给您存件 , 请及时取件 , 取件码: {号码,8} , 取件二维码: {链接,30}"),
    SAVE("[{名称,10}]您的{案号,20} 案件材料, 通过云柜系统存件成功! 我们已经通知收件人取件 , 欢迎您下次使用"),
    MSG_CODE("[{名称,10}]您正在进行短信验证，验证码：{数字,8}，请勿告知他人"),
    BACK_MSG("【案件流转云柜】您好，{姓名,4}法官，{案号,30}档案，案件已结案，管理员提醒您及时归还"),
    THING_MSG("你有一项编号为{验证码,6}的事务需要处理。"),
    DSR_MSG("你好{法官姓名,4}法官，{姓名,4}、当事人身份证号 {身份证,18} 、当事人手机号 {手机号,11} , {时间,20}通过诉讼服务约见法官系统给你留言。内容详见{地址,20} 。"),
    LS_MSG("你好{法官姓名,4}法官，案件编号{案号,20}，律师执业证号{资格证,20} 、律师身份证号{身份证,18} 、律师手机号{手机号,11} , {时间,20}通过诉讼服务约见法官系统给你留言。内容详见{地址,30} 。"),
    PHONE_DSR("你好{法官姓名,4}法官，{姓名,4}、当事人身份证号 {身份证,18}、当事人手机号{手机号,11}, {时间,20}通过诉讼服务约见法官系统给你来电。"),
    PHONE_LS("你好{法官姓名,4}法官，案件编号{案号,20}，律师执业证号 {资格证,18}、律师身份证号 {身份证,18} 、律师手机号{手机号,11} , {时间,20}通过诉讼服务约见法官系统给你来电。")
    ;

    private String context;

    NewSmsEnum(String context) {
        this.context = context;
    }

}
