package com.bzfar.enums;

import io.swagger.annotations.ApiModel;
import lombok.Getter;

@Getter
@ApiModel("短息模板")
public enum OldSmsEnum {

    FUCHENG_MSG("【智能材料收转云柜】您好，柜格可用数量@个，请注意及时处理。"),
    YJFG_MSG("【@】您好@法官,手机号@ ,通过约见法官终端给你留言。@@@@ "),
    YJFG_PHONE_MSG("【@】您好@法官,@、证件号@、手机号@ ,@@通过约见法官终端给你来电。"),
    YJFG_SEMD_MSG("【@】您好@法官,@、证件号@、手机号@ ,@@通过约见法官终端给你留言。@@@@ "),
    FG_MSG("【百智诚远】您好@、手机号：@ 通过联系终端给你留言，详情: @@@@"),
    YG_MSG("【智能材料收转云柜】@您好，@@@@通过材料收转云柜给您存件，取件码为：@。请及时拿取！"),
    YG_CODE("【@】您正在进行短信验证，验证码：@，请勿告知他人。"),
    YG_ONE_CODE("【@】您好，您的验证码是：@@，请勿告知他人。"),
    YG_QS_MSG("【@】@案件材料, 已经被成功签收 , 收件人: @(@)"),
    YG_QJ_MSG("【@】 @案件材料, @(@) , 联系方式: @ , 通过云柜系统给您存件 , 请及时取件 , 取件码: @ , 取件二维码: @"),
    YG_CJ_MSG("【@】 您的@案件材料, 通过云柜系统存件成功! 我们已经通知收件人取件 , 欢迎您下次使用"),
    WH_MSG("【武侯区人民法院】你好，@@@、手机号@@@，通过约见法官系统给你留言。内容详见@@@@@"),
    CLSZ_MSG("【材料收转云柜】您好，@@@法官，(@@)@@@档案，案件已结案，管理员提醒您及时归还"),
    CLSZ_ONE_MSG("【材料收转云柜】您好，@@@法官，(@@@)@@档案，已归还至智能流转柜。 "),
    CLSZ_TWO_MSG("【材料收转云柜】您好，@@@法官，(@@)@@@档案，@@@提醒您及时归还"),
    E_MSG("【E封条】通知：您的设备@(@@)，有一条检修通知，请及时进行处理，并登陆E封条小程序，反馈检修结果。————@@ "),
    E_ONE_MSG("【E封条】通知：您的案件@@，有新的预警通知，点击@@@@@查看。————@@"),
    E_TWO_MSG("【E封条】尊敬的用户您好，您的注册申请已经通过，如有任何问题可致电百智诚远唯一客服热线400-027-8139 "),
    E_THREE_MEG("【E封条】尊敬的用户您好，您的注册申请审核未通过，如有任何问题可致电百智诚远唯一客服热线400-027-8139"),
    E_FOUR_MSG("【E封条】尊敬的用户您好，您的验证码为@，有效期为10分钟，如有任何问题可致电百智诚远唯一客服热线400-027-8139"),
    BZ_CODE("【百智诚远】您的验证码为：@请勿将验证码透露给任何人!"),
    BZ_CODE_MSG("【百智诚远】您的验证码为:@@@@ 请勿将验证码透露给任何人! "),
    WWZ_MSG("【智能辅助平台-微网站】你好，设备识别码: @@@ , 验证码: @@@ "),
    WFY_MSG("【智能辅助平台-微法院】你好，设备识别码: @@@ , 验证码: @@@"),
    TJPT_MSG("【智能辅助平台-调解平台】你好，设备识别码: @@@ , 验证码: @@@"),
    SSFWW_MSG("【智能辅助平台-诉讼服务网】你好，设备识别码: @@@ , 验证码: @@@ "),
    YG_QJ_CODE("【智能材料收转云柜】@您好，@@@@@通过材料收转云柜给您存件，取件码为：@请及时拿取！取件二维码为：@@@@@ "),
    YG_QJ_ONE("【智能材料收转云柜】@您好，@已经将您的材料放入云柜中，材料页码数为：@页，取件码为：@请及时拿取！取件二维码为：@@@@@"),
    YJFGS_MSG("【@】你好，@@，通过约见法官系统给你留言。内容详见@@@。"),
    SZYG_CODE("【智能材料收转云柜】你好，您的验证码是@，请勿将验证码提供给他人。"),
    SZYG_MSG("【智能材料收转云柜】@您好，@已经将您的材料放入云柜中，材料页码数为：@页，取件码为：@请及时拿取！取件二维码为：@@@@ "),
    SZYG_TAKE("【智能材料收转云柜】@您好，您已成功取出云柜@的材料。"),
    SZYG_TAKE_MSG("【智能材料收转云柜】@您好，@已经将您存放至云柜@的材料取走。"),
    SZYG_TIME_OUT("【智能材料收转云柜】@您好，您待取的材料已放置云柜@中24个小时了，请及时取件。"),
    SZYG_TAKE_OK("【智能材料收转云柜】@您好，@已成功将您的材料从云柜取出，请及时联系管理员取走您的材料。 "),
    MLFY_MSG("【弥勒市人民法院】@您好，@已成功将您的材料从云柜取出，请及时联系管理员取走您的材料。"),
    MLFY_TAKE_TIMEOUT("【弥勒市人民法院】@您好，您待取的材料已放置云柜@中24个小时了，请及时取件。"),
    MLFY_TAKE_OK("【弥勒市人民法院】@您好，@已经将您存放至云柜@的材料取走。 "),
    MLFY_TAKE_ONE("【弥勒市人民法院】@您好，您已成功取出云柜@的材料。 "),
    MLFY_TAKE("【弥勒市人民法院】@您好，@已经将您的材料放入云柜中，材料页码数为：@页，取件码为：@请及时拿取！取件二维码为：@@@@"),
    MLFY_CODE("【弥勒市人民法院】你好，您的验证码是@，请勿将验证码提供给他人。")
    ;

    private String context;
    OldSmsEnum(String context){
        this.context = context;
    };
}
