package com.bzfar.enums;

import io.swagger.annotations.ApiModel;
import lombok.Getter;

@Getter
@ApiModel("短息模板")
public enum OldSmsEnum {
    fucheng_msg("【智能材料收转云柜】您好，柜格可用数量@个，请注意及时处理。"),
    Yjfg_msg("【@】您好@法官,手机号@ ,通过约见法官终端给你留言。@@@@ "),
    yjfg_phone_msg("【@】您好@法官,@、证件号@、手机号@ ,@@通过约见法官终端给你来电。"),
    yjfg_semd_msg("【@】您好@法官,@、证件号@、手机号@ ,@@通过约见法官终端给你留言。@@@@ "),
    fg_msg("【百智诚远】您好@、手机号：@ 通过联系终端给你留言，详情: @@@@"),
    yg_msg("【智能材料收转云柜】@您好，@@@@通过材料收转云柜给您存件，取件码为：@。请及时拿取！"),
    yg_code("【@】您正在进行短信验证，验证码：@，请勿告知他人。"),
    yg_one_code("【@】您好，您的验证码是：@@，请勿告知他人。"),
    yg_qs_msg("【@】@案件材料, 已经被成功签收 , 收件人: @(@)"),
    yg_qj_msg("【@】 @案件材料, @(@) , 联系方式: @ , 通过云柜系统给您存件 , 请及时取件 , 取件码: @ , 取件二维码: @"),
    yg_cj_msg("【@】 您的@案件材料, 通过云柜系统存件成功! 我们已经通知收件人取件 , 欢迎您下次使用"),
    wh_msg("【武侯区人民法院】你好，@@@、手机号@@@，通过约见法官系统给你留言。内容详见@@@@@"),
    clsz_msg("【材料收转云柜】您好，@@@法官，(@@)@@@档案，案件已结案，管理员提醒您及时归还"),
    clsz_one_msg("【材料收转云柜】您好，@@@法官，(@@@)@@档案，已归还至智能流转柜。 "),
    clsz_two_msg("【材料收转云柜】您好，@@@法官，(@@)@@@档案，@@@提醒您及时归还"),
    e_msg("【E封条】通知：您的设备@(@@)，有一条检修通知，请及时进行处理，并登陆E封条小程序，反馈检修结果。————@@ "),
    e_one_msg("【E封条】通知：您的案件@@，有新的预警通知，点击@@@@@查看。————@@"),
    e_two_msg("【E封条】尊敬的用户您好，您的注册申请已经通过，如有任何问题可致电百智诚远唯一客服热线400-027-8139 "),
    e_three_meg("【E封条】尊敬的用户您好，您的注册申请审核未通过，如有任何问题可致电百智诚远唯一客服热线400-027-8139"),
    e_four_msg("【E封条】尊敬的用户您好，您的验证码为@，有效期为10分钟，如有任何问题可致电百智诚远唯一客服热线400-027-8139"),
    bz_code("【百智诚远】您的验证码为：@请勿将验证码透露给任何人!"),
    bz_code_msg("【百智诚远】您的验证码为:@@@@ 请勿将验证码透露给任何人! "),
    wwz_msg("【智能辅助平台-微网站】你好，设备识别码: @@@ , 验证码: @@@ "),
    wfy_msg("【智能辅助平台-微法院】你好，设备识别码: @@@ , 验证码: @@@"),
    tjpt_msg("【智能辅助平台-调解平台】你好，设备识别码: @@@ , 验证码: @@@"),
    ssfww_msg("【智能辅助平台-诉讼服务网】你好，设备识别码: @@@ , 验证码: @@@ "),
    yg_qj_code("【智能材料收转云柜】@您好，@@@@@通过材料收转云柜给您存件，取件码为：@请及时拿取！取件二维码为：@@@@@ "),
    yg_qj_one("【智能材料收转云柜】@您好，@已经将您的材料放入云柜中，材料页码数为：@页，取件码为：@请及时拿取！取件二维码为：@@@@@"),
    yjfg_msg("【@】你好，@@，通过约见法官系统给你留言。内容详见@@@。"),
    szyg_code("【智能材料收转云柜】你好，您的验证码是@，请勿将验证码提供给他人。"),
    szyg_msg("【智能材料收转云柜】@您好，@已经将您的材料放入云柜中，材料页码数为：@页，取件码为：@请及时拿取！取件二维码为：@@@@ "),
    szyg_take("【智能材料收转云柜】@您好，您已成功取出云柜@的材料。"),
    szyg_take_msg("【智能材料收转云柜】@您好，@已经将您存放至云柜@的材料取走。"),
    szyg_time_out("【智能材料收转云柜】@您好，您待取的材料已放置云柜@中24个小时了，请及时取件。"),
    szyg_take_ok("【智能材料收转云柜】@您好，@已成功将您的材料从云柜取出，请及时联系管理员取走您的材料。 "),
    mlfy_msg("【弥勒市人民法院】@您好，@已成功将您的材料从云柜取出，请及时联系管理员取走您的材料。"),
    mlfy_take_timeout("【弥勒市人民法院】@您好，您待取的材料已放置云柜@中24个小时了，请及时取件。"),
    mlfy_take_ok("【弥勒市人民法院】@您好，@已经将您存放至云柜@的材料取走。 "),
    mlfy_take_one("【弥勒市人民法院】@您好，您已成功取出云柜@的材料。 "),
    mlfy_take("【弥勒市人民法院】@您好，@已经将您的材料放入云柜中，材料页码数为：@页，取件码为：@请及时拿取！取件二维码为：@@@@"),
    mlfy_code("【弥勒市人民法院】你好，您的验证码是@，请勿将验证码提供给他人。")
    ;

    private String context;
    OldSmsEnum(String context){
        this.context = context;
    };
}
